wiki/2016-09-23-mvnw是什么（Maven_Wrapper_Maven保持构建工具版本一直的工具）.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>mvnw是什么（Maven Wrapper/Maven保持构建工具版本一直的工具）</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">mvnw是什么（Maven Wrapper/Maven保持构建工具版本一直的工具）</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> <a href="https://bruceasu.github.io/tags.html#maven"><div class="category">maven</div></a> <a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-09-23</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7a5d3e">背景</a>
<ul>
<li><a href="#org54de438">方法一：在Pom.Xml中添加Plugin声明：</a></li>
<li><a href="#org0b2bcd8">方法二：直接执行Goal（推荐使用这种）</a></li>
</ul>
</li>
<li><a href="#org53c25c8">参考：</a></li>
<li><a href="#org56d4ee6">自定义settings.xml</a></li>
</ul>
</div>
</nav>
<p>
mvnw是什么（Maven Wrapper/Maven保持构建工具版本一直的工具）
</p>


<div id="outline-container-orga7a5d3e" class="outline-2">
<h2 id="orga7a5d3e">背景</h2>
<div class="outline-text-2" id="text-orga7a5d3e">
<p>
Maven是一款非常流行的Java项目构建软件，它集项目的依赖管理、测试用例运行、打包、
构件管理于一身，是我们工作的好帮手，maven飞速发展，它的发行版本也越来越多，如果
我们的项目是基于Maven构件的，那么如何保证拿到我们项目源码的同事的Maven版本和我们
开发时的版本一致呢，可能你认为很简单，一个公司嘛，规定所有的同事都用一个Maven版
本不就万事大吉了吗？一个组织内部这是可行的，要是你开源了一个项目呢？如何保证你使
用的Maven的版本和下载你源码的人的Maven的版本一致呢，这时候mvnw就大显身手了。
</p>

<p>
mvnw全名是Maven Wrapper,它的原理是在maven-wrapper.properties文件中记录你要使用的
Maven版本，当用户执行mvnw clean 命令时，发现当前用户的Maven版本和期望的版本不一
致，那么就下载期望的版本，然后用期望的版本来执行mvn命令，比如刚才的mvn clean。
</p>

<p>
为项目添加mvnw支持很简单，有两种方式：
</p>
</div>

<div id="outline-container-org54de438" class="outline-3">
<h3 id="org54de438">方法一：在Pom.Xml中添加Plugin声明：</h3>
<div class="outline-text-3" id="text-org54de438">
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="font-weight: bold;">plugin</span>&gt;
    &lt;<span style="font-weight: bold;">groupId</span>&gt;com.rimerosolutions.maven.plugins&lt;/<span style="font-weight: bold;">groupId</span>&gt;
    &lt;<span style="font-weight: bold;">artifactId</span>&gt;wrapper-maven-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
    &lt;<span style="font-weight: bold;">version</span>&gt;0.0.4&lt;/<span style="font-weight: bold;">version</span>&gt;
&lt;/<span style="font-weight: bold;">plugin</span>&gt;

</pre>
</div>
<p>
这样当我们执行mvn wrapper:wrapper 时，会帮我们生成mvnw.bat、mvnw、
maven/maven-wrapper.jar、maven/maven-wrapper.properties这些文件。
</p>

<p>
然后我们就可以使用mvnw代替mvn命令执行所有的maven命令，比如mvnw clean package
</p>
</div>
</div>

<div id="outline-container-org0b2bcd8" class="outline-3">
<h3 id="org0b2bcd8">方法二：直接执行Goal（推荐使用这种）</h3>
<div class="outline-text-3" id="text-org0b2bcd8">
<pre class="example">
mvn -N io.takari:maven:wrapper -Dmaven=3.3.3表示我们期望使用的Maven的版本为3.3.3

</pre>

<p>
产生的内容和第一种方式是一样的，只是目录结构不一样，maven-wrapper.jar和
maven-wrapper.properties在".mvn/wrapper"目录下
</p>

<p>
使用的注意事项
</p>

<ul class="org-ul">
<li>1、由于我们使用了新的Maven ,如果你的settings.xml没有放在当前用户下的.m2目录下，</li>
</ul>
<p>
那么执行mvnw时不会去读取你原来的settings.xml文件
</p>

<ul class="org-ul">
<li>2、在mvnw.bat中有如下的一段脚本：if exist "%M2<sub>HOME</sub>%\bin\mvn.cmd" goto init，意思</li>
</ul>
<p>
是如果找到mvn.cmd就执行初始化操作，但是Maven早期版本不叫mvn.cmd，而是叫mvn.bat，
所以会报"Error: M2<sub>HOME</sub> is set to an invalid directory"错误，改成你本地的maven的
匹配后缀就好了。
</p>

<p>
测试工程：<a href="https://github.com/easonjim/5_java_example/tree/master/mvnw/testproject">https://github.com/easonjim/5_java_example/tree/master/mvnw/testproject</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org53c25c8" class="outline-2">
<h2 id="org53c25c8">参考：</h2>
<div class="outline-text-2" id="text-org53c25c8">
<p>
<a href="https://github.com/takari/maven-wrapper%EF%BC%88%E5%AE%98%E7%BD%91">https://github.com/takari/maven-wrapper（官网</a>）
</p>
</div>
</div>

<div id="outline-container-org56d4ee6" class="outline-2">
<h2 id="org56d4ee6">自定义settings.xml</h2>
<div class="outline-text-2" id="text-org56d4ee6">
<p>
./mvnw clean install -s .mvn/wrapper/settings.xml
</p>

<p>
<a href="http://www.javacoder.cn/?p=759%EF%BC%88%E4%BB%A5%E4%B8%8A%E5%86%85%E5%AE%B9%E8%BD%AC%E8%87%AA%E6%AD%A4%E7%AF%87%E6%96%87%E7%AB%A0">http://www.javacoder.cn/?p=759（以上内容转自此篇文章</a>）
</p>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
